app/controllers/reports_controller.rb

  def index
    @reports = Report.order(sort_column + " " + sort_direction).paginate(:per_page => 50, :page => params[:page])
---
SELECT  "reports".* FROM "reports" WHERE (date_of_call BETWEEN '2018-01-08' AND '2018-01-16') ORDER BY date_of_call desc LIMIT ? OFFSET ?  [["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reports" WHERE (date_of_call BETWEEN '2018-01-08' AND '2018-01-16')